// -------------------  Auto Generate Begin --------------------

mapping data = ([ 
 
	1:([ 
	  "y":450,  
	  "x":900,  
	  "sname":"人界",  
	  "icon":30018,  
	  "gname":"黄飞虎", ]),
	2:([ 
	  "y":450,  
	  "x":1200,  
	  "sname":"人界",  
	  "icon":30019,  
	  "gname":"李靖", ]),
	3:([ 
	  "y":450,  
	  "x":1500,  
	  "sname":"人界",  
	  "icon":30026,  
	  "gname":"鬼谷子", ]),
	4:([ 
	  "y":450,  
	  "x":900,  
	  "sname":"地界",  
	  "icon":30032,  
	  "gname":"赵文和", ]),
	5:([ 
	  "y":450,  
	  "x":1200,  
	  "sname":"地界",  
	  "icon":30015,  
	  "gname":"杜子仁", ]),
	6:([ 
	  "y":450,  
	  "x":1500,  
	  "sname":"地界",  
	  "icon":30014,  
	  "gname":"卞城王", ]),
	7:([ 
	  "y":450,  
	  "x":900,  
	  "sname":"天界",  
	  "icon":30043,  
	  "gname":"增长天王", ]),
	8:([ 
	  "y":450,  
	  "x":1200,  
	  "sname":"天界",  
	  "icon":30044,  
	  "gname":"持国天王", ]),
	9:([ 
	  "y":450,  
	  "x":1500,  
	  "sname":"天界",  
	  "icon":30045,  
	  "gname":"广目天王", ]),
	10:([ 
	  "y":450,  
	  "x":1800,  
	  "sname":"天界",  
	  "icon":30048,  
	  "gname":"多闻天王", ]),
 
]);

mapping get_data()
{
	return data;
}
// from tmp/data/三界闯关.xls
// -------------------  Auto Generate End   --------------------
