// -------------------  Auto Generate Begin --------------------

mapping data = ([ 
 
	1:([ 
	  "y":129,  
	  "x":158,  
	  "fbName":"小山林", ]),
	2:([ 
	  "y":133,  
	  "x":397,  
	  "fbName":"密林深处", ]),
	3:([ 
	  "y":114,  
	  "x":595,  
	  "fbName":"昆仑山腰", ]),
	4:([ 
	  "y":311,  
	  "x":254,  
	  "fbName":"锁蛟石", ]),
	5:([ 
	  "y":335,  
	  "x":482,  
	  "fbName":"玉虚宫门", ]),
	6:([ 
	  "y":324,  
	  "x":673,  
	  "fbName":"昆仑山颠", ]),
	7:([ 
	  "y":110,  
	  "x":183,  
	  "fbName":"藏书阁外", ]),
	8:([ 
	  "y":148,  
	  "x":380,  
	  "fbName":"藏书阁内", ]),
	9:([ 
	  "y":98,  
	  "x":674,  
	  "fbName":"司天台", ]),
	10:([ 
	  "y":286,  
	  "x":82,  
	  "fbName":"司天台顶", ]),
	11:([ 
	  "y":343,  
	  "x":275,  
	  "fbName":"幻境一", ]),
	12:([ 
	  "y":334,  
	  "x":513,  
	  "fbName":"幻境二", ]),
	13:([ 
	  "y":295,  
	  "x":716,  
	  "fbName":"幻境深处", ]),
	34:([ 
	  "y":120,  
	  "x":129,  
	  "fbName":"不周山脚", ]),
	36:([ 
	  "y":116,  
	  "x":407,  
	  "fbName":"不周山裂口", ]),
	37:([ 
	  "y":141,  
	  "x":632,  
	  "fbName":"巫族营地", ]),
	39:([ 
	  "y":311,  
	  "x":181,  
	  "fbName":"巫族营地内", ]),
	40:([ 
	  "y":326,  
	  "x":402,  
	  "fbName":"通天藤路", ]),
	41:([ 
	  "y":337,  
	  "x":643,  
	  "fbName":"女娲台", ]),
	44:([ 
	  "y":99,  
	  "x":91,  
	  "fbName":"万妖谷一", ]),
	45:([ 
	  "y":110,  
	  "x":227,  
	  "fbName":"万妖谷二", ]),
	46:([ 
	  "y":133,  
	  "x":415,  
	  "fbName":"万妖谷禁地", ]),
	47:([ 
	  "y":145,  
	  "x":594,  
	  "fbName":"不死宫一", ]),
	48:([ 
	  "y":91,  
	  "x":722,  
	  "fbName":"不死宫二", ]),
	49:([ 
	  "y":292,  
	  "x":76,  
	  "fbName":"不死宫前", ]),
	50:([ 
	  "y":353,  
	  "x":232,  
	  "fbName":"火山深处一", ]),
	51:([ 
	  "y":270,  
	  "x":368,  
	  "fbName":"火山深处二", ]),
	52:([ 
	  "y":326,  
	  "x":539,  
	  "fbName":"火山深处三", ]),
	53:([ 
	  "y":348,  
	  "x":722,  
	  "fbName":"不死宫", ]),
	24:([ 
	  "y":116,  
	  "x":91,  
	  "fbName":"麒麟崖一", ]),
	25:([ 
	  "y":99,  
	  "x":258,  
	  "fbName":"麒麟崖二", ]),
	26:([ 
	  "y":152,  
	  "x":408,  
	  "fbName":"麒麟崖顶", ]),
	27:([ 
	  "y":91,  
	  "x":572,  
	  "fbName":"巫族山寨一", ]),
	28:([ 
	  "y":122,  
	  "x":737,  
	  "fbName":"巫族山寨二", ]),
	29:([ 
	  "y":338,  
	  "x":64,  
	  "fbName":"山寨内", ]),
	30:([ 
	  "y":293,  
	  "x":230,  
	  "fbName":"无劫山一", ]),
	31:([ 
	  "y":303,  
	  "x":424,  
	  "fbName":"无劫山二", ]),
	32:([ 
	  "y":335,  
	  "x":587,  
	  "fbName":"无劫山三", ]),
	33:([ 
	  "y":295,  
	  "x":738,  
	  "fbName":"无劫山顶", ]),
	14:([ 
	  "y":97,  
	  "x":89,  
	  "fbName":"东海龙宫一", ]),
	15:([ 
	  "y":125,  
	  "x":254,  
	  "fbName":"东海龙宫二", ]),
	16:([ 
	  "y":139,  
	  "x":419,  
	  "fbName":"水晶宫", ]),
	17:([ 
	  "y":98,  
	  "x":576,  
	  "fbName":"踏仙台一", ]),
	18:([ 
	  "y":158,  
	  "x":718,  
	  "fbName":"踏仙台二", ]),
	19:([ 
	  "y":252,  
	  "x":128,  
	  "fbName":"踏仙台上", ]),
	20:([ 
	  "y":342,  
	  "x":249,  
	  "fbName":"天地龙门一", ]),
	21:([ 
	  "y":280,  
	  "x":376,  
	  "fbName":"天地龙门二", ]),
	22:([ 
	  "y":248,  
	  "x":553,  
	  "fbName":"天地龙门三", ]),
	23:([ 
	  "y":368,  
	  "x":695,  
	  "fbName":"天地龙门之顶", ]),
	500:([ 
	  "y":0,  
	  "x":0,  
	  "fbName":"人界", ]),
 
]);

mapping get_data()
{
	return data;
}
// from tmp/data/副本.xls
// -------------------  Auto Generate End   --------------------
